<a href="https://colab.research.google.com/github/hadi-M/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/HADI_MODARES_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [98]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-12 15:31:49--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.45.246
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.45.246|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  46.1MB/s    in 4.6s

2020-03-12 15:31:54 (42.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [99]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz
!rm instacart_online_grocery_shopping_2017_05_01.tar.gz
# !rm -rf instacart_2017_05_01/
# %ls

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [100]:
%cd  instacart_2017_05_01/

/content/instacart_2017_05_01

In [101]:
%pwd

'/content/instacart_2017_05_01'

In [102]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [11]:
##### YOUR CODE HERE #####
%cd ./instacart_2017_05_01/
# %ls

/content/instacart_2017_05_01

In [12]:
!head ./* -n 5
!ls

==> ./aisles.csv <==
aisle_id,aisle
1,prepared soups salads
2,specialty cheeses
3,energy granola bars
4,instant foods

==> ./departments.csv <==
department_id,department
1,frozen
2,other
3,bakery
4,produce

==> ./order_products__prior.csv <==
order_id,product_id,add_to_cart_order,reordered
2,33120,1,1
2,28985,2,1
2,9327,3,0
2,45918,4,1

==> ./order_products__train.csv <==
order_id,product_id,add_to_cart_order,reordered
1,49302,1,1
1,11109,2,1
1,10246,3,0
1,49683,4,0

==> ./orders.csv <==
order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2539329,1,prior,1,2,08,
2398795,1,prior,2,3,07,15.0
473747,1,prior,3,3,12,21.0
2254736,1,prior,4,4,07,29.0

==> ./products.csv <==
product_id,product_name,aisle_id,department_id
1,Chocolate Sandwich Cookies,61,19
2,All-Seasons Salt,104,13
3,Robust Golden Unsweetened Oolong Tea,94,7
4,Smart Ones Classic Favorites Mini Rigatoni With Vodka Cream Sauce,38,1
aisles.csv	 order_products__prior.csv  orders.csv
departments.csv  order_products__train.csv  products.csv

In [0]:
import pandas as pd

In [14]:
# top_products = [
#   "Banana",
#   "Bag of Organic Bananas",
#   "Organic Strawberries",
#   "Organic Baby Spinach",
#   "Organic Hass Avocado",
#   "Organic Avocado",
#   "Large Lemon",
#   "Strawberries",
#   "Limes",
#   "Organic Whole Milk"
# ]

# i just found the top 10 products on myself so didn't need the list

product_df = pd.read_csv("products.csv")
product_df.head(5)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [15]:
product_subset_df = product_df[["product_name", "product_id"]]
product_subset_df.head(5)

                                        product_name  product_id
0                         Chocolate Sandwich Cookies           1
1                                   All-Seasons Salt           2
2               Robust Golden Unsweetened Oolong Tea           3
3  Smart Ones Classic Favorites Mini Rigatoni Wit...           4
4                          Green Chile Anytime Sauce           5

In [16]:
order_products__prior_df = pd.read_csv("order_products__prior.csv")
order_products__train_df = pd.read_csv("order_products__train.csv")
order_products_total = pd.concat(
  [
    order_products__prior_df,
    order_products__train_df
  ],
  ignore_index=True
)

del order_products__prior_df
del order_products__train_df

order_products_total.head(5)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [17]:
order_products_total = order_products_total[["order_id", "product_id"]]
order_products_total.head(5)

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [18]:
order_product_name_df = pd.merge(order_products_total, product_subset_df, on="product_id")
del product_subset_df
order_product_name_df.head(5)

   order_id  product_id        product_name
0         2       33120  Organic Egg Whites
1        26       33120  Organic Egg Whites
2       120       33120  Organic Egg Whites
3       327       33120  Organic Egg Whites
4       390       33120  Organic Egg Whites

In [0]:
# %cd ..
# !rm -rf instacart_2017_05_01
# %ls

In [20]:
order_product_name_df = order_product_name_df[["product_name", "order_id"]]
del order_products_total
order_product_name_df.head(5)

         product_name  order_id
0  Organic Egg Whites         2
1  Organic Egg Whites        26
2  Organic Egg Whites       120
3  Organic Egg Whites       327
4  Organic Egg Whites       390

In [21]:
order_product_name_df["product_name"].value_counts().head(10)
# These are the results

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [23]:
order_product_name_df.head(5)

         product_name  order_id
0  Organic Egg Whites         2
1  Organic Egg Whites        26
2  Organic Egg Whites       120
3  Organic Egg Whites       327
4  Organic Egg Whites       390

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [24]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [25]:
# table2 -> tidy
t2_melted = pd.melt(table2.reset_index(), id_vars="index", var_name="name")
t2_melted

        index          name  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [26]:
# tidy -> table2
pd.pivot(t2_melted, index="index", columns="name")

              value
name       Jane Doe John Smith Mary Johnson
index
treatmenta     16.0        NaN          3.0
treatmentb     11.0        2.0          1.0

In [0]:
import seaborn as sns

In [28]:
flights = sns.load_dataset('flights')
flights.head(5)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [29]:
# Flights Pivot Table

flights_pivoted = pd.pivot(flights, index="year", columns="month", values="passengers")
flights_pivoted

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####
# !head ./* -n 8

In [0]:
# top25_products = order_product_name_df["product_name"].value_counts().head(25)
# top25_products

# I just realized this is not what it was asked for!
# this would show the top 25 popular products!

In [32]:
orders_df = pd.read_csv("./orders.csv")
orders_df.head(5)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [37]:
# orders_df["order_id"].duplicated().sum()
orders_23_df = orders_df[orders_df["order_hour_of_day"] == 23]
del orders_df
orders_23_df.head(5)

     order_id  user_id  ... order_hour_of_day  days_since_prior_order
182   3069802       17  ...                23                     4.0
474   1210985       32  ...                23                    30.0
811     51418       54  ...                23                     0.0
833   1102893       54  ...                23                     2.0
842   3370941       54  ...                23                     2.0

[5 rows x 7 columns]

In [41]:
order_products__prior_df = pd.read_csv("order_products__prior.csv")
order_products__train_df = pd.read_csv("order_products__train.csv")
order_products_total = pd.concat(
  [
    order_products__prior_df,
    order_products__train_df
  ],
  ignore_index=True
)

del order_products__prior_df
del order_products__train_df

order_products_total.head(5)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [52]:

order_product_id_23_df = \
order_products_total[order_products_total["order_id"]
                     .isin(orders_23_df["order_id"].values)
                     ]
order_product_id_23_df.head(5)

      order_id  product_id  add_to_cart_order  reordered
1451       160       31915                  1          1
1452       160       21137                  2          1
1453       160       24390                  3          0
1454       160       25477                  4          0
1455       160       25331                  5          0

In [45]:
product_df = pd.read_csv("products.csv")
product_subset_df = product_df[["product_name", "product_id"]]
del product_df
product_subset_df.head(5)

                                        product_name  product_id
0                         Chocolate Sandwich Cookies           1
1                                   All-Seasons Salt           2
2               Robust Golden Unsweetened Oolong Tea           3
3  Smart Ones Classic Favorites Mini Rigatoni Wit...           4
4                          Green Chile Anytime Sauce           5

In [49]:
order_product_name_df = pd.merge(order_product_id_23_df, product_subset_df, on="product_id")[["order_id", "product_name"]]
order_product_name_df.head(5)

   order_id                 product_name
0       160  Organic Red Delicious Apple
1       563  Organic Red Delicious Apple
2      7869  Organic Red Delicious Apple
3     24003  Organic Red Delicious Apple
4     36045  Organic Red Delicious Apple

In [51]:
order_product_name_df["product_name"].value_counts().head(25)

Banana                                  5587
Bag of Organic Bananas                  5098
Organic Strawberries                    3677
Organic Baby Spinach                    3304
Organic Hass Avocado                    2702
Organic Avocado                         2280
Strawberries                            1920
Large Lemon                             1906
Organic Raspberries                     1872
Organic Whole Milk                      1870
Limes                                   1823
Organic Blueberries                     1533
Organic Zucchini                        1508
Organic Garlic                          1463
Organic Yellow Onion                    1394
Cucumber Kirby                          1250
Organic Lemon                           1191
Organic Cucumber                        1180
Organic Grape Tomatoes                  1165
Seedless Red Grapes                     1137
Organic Baby Carrots                    1103
Organic Cilantro                        1074
Organic Large Extra Fancy Fuji Apple    1045
Carrots                                 1037
Apple Honeycrisp Organic                1015
Name: product_name, dtype: int64

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [34]:
!head ./* -n 8

==> ./aisles.csv <==
aisle_id,aisle
1,prepared soups salads
2,specialty cheeses
3,energy granola bars
4,instant foods
5,marinades meat preparation
6,other
7,packaged meat

==> ./departments.csv <==
department_id,department
1,frozen
2,other
3,bakery
4,produce
5,alcohol
6,international
7,beverages

==> ./order_products__prior.csv <==
order_id,product_id,add_to_cart_order,reordered
2,33120,1,1
2,28985,2,1
2,9327,3,0
2,45918,4,1
2,30035,5,0
2,17794,6,1
2,40141,7,1

==> ./order_products__train.csv <==
order_id,product_id,add_to_cart_order,reordered
1,49302,1,1
1,11109,2,1
1,10246,3,0
1,49683,4,0
1,43633,5,1
1,13176,6,0
1,47209,7,0

==> ./orders.csv <==
order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2539329,1,prior,1,2,08,
2398795,1,prior,2,3,07,15.0
473747,1,prior,3,3,12,21.0
2254736,1,prior,4,4,07,29.0
431534,1,prior,5,4,15,28.0
3367565,1,prior,6,2,07,19.0
550135,1,prior,7,1,09,20.0

==> ./products.csv <==
product_id,product_name,aisle_id,department_id
1,Chocolate Sandwich Cookies,61,19
2,All-Seasons Salt,104,13
3,Robust Golden Unsweetened Oolong Tea,94,7
4,Smart Ones Classic Favorites Mini Rigatoni With Vodka Cream Sauce,38,1
5,Green Chile Anytime Sauce,5,13
6,Dry Nose Oil,11,11
7,Pure Coconut Water With Orange,98,7

In [0]:
##### YOUR CODE HERE #####
orders_df = pd.read_csv("orders.csv")

In [36]:
# users' last order
orders_df.loc[orders_df.groupby("user_id")["order_number"].idxmax()]

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
10        1187899        1  ...                 8                    14.0
25        1492625        2  ...                11                    30.0
38        2774568        3  ...                15                    11.0
44         329954        4  ...                12                    30.0
49        2196797        5  ...                11                     6.0
...           ...      ...  ...               ...                     ...
3420933   1716008   206205  ...                16                    10.0
3421001   1043943   206206  ...                20                     0.0
3421018   2821651   206207  ...                13                    14.0
3421068    803273   206208  ...                11                     4.0
3421082    272231   206209  ...                14                    30.0

[206209 rows x 7 columns]